package ru.mephi.week3.lesson1.task;

public class RestaurantSimulator {

    /**
     * <H2>Задача: Система обработки заказов ресторана</H2>
     * <br>
     * <H2>📌 Задание</H2>
     * <p>Представьте, что вы разрабатываете систему обработки заказов для ресторана.
     * Заказы поступают от клиентов, затем передаются на приготовление,
     * после чего курьеры их доставляют. </p>
     *
     * <p>Ваша задача – реализовать многопоточное выполнение этой системы
     * с помощью `ExecutorService`, так чтобы:</p>
     * <ul>
     *    <li>Заказы обрабатывались и передавались на кухню</li>
     *    <li>Кухня готовила блюда в нескольких потоках</li>
     *    <li>Курьеры доставляли готовые заказы</li>
     * </ul>
     *
     * <H2>💡 Условия:</H2>
     * <ol>
     *    <li>Заказы поступают каждую секунду.</li>
     *    <li>Приготовление каждого заказа занимает 3 секунды.</li>
     *    <li>Доставка занимает 2 секунды.</li>
     *    <li>Общее количество заказов – 10.</li>
     * </ol>
     *
     * <br>
     */

    public static void main(String[] args) {

    }

}
