package ru.mephi.week1.lesson1;

public class Task2 {

    /**
     * <H2>Задача: Параллельный подсчёт простых чисел</H2>
     * <br>
     * <H2>📌 Задание</H2>
     * <p>Вам необходимо разработать программу, которая будет вычислять количество простых чисел в заданном диапазоне чисел от 1 до N. Задача заключается в том, чтобы использовать несколько потоков для параллельного поиска простых чисел, каждый поток будет обрабатывать часть диапазона чисел. По окончании работы всех потоков, программа должна вывести общее количество простых чисел.</p>
     * <br>
     * <H2>Условия</H2>
     * <ol>
     *    <li>Число N задаётся пользователем (например, N = 10000).</li>
     *    <li>Каждый поток будет работать с определённым диапазоном чисел.</li>
     *    <li>Потоки должны работать параллельно, вычисляя количество простых чисел в своих диапазонах.</li>
     *    <li>После того как все потоки завершат свою работу, программа должна вывести общее количество простых чисел.</li>
     * </ol>
     */

    public static void main(String[] args) {

    }

}
